---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotChangeWorkplaneVisibility
source: html/a47ce9d0-b5e6-ed9c-cd8d-b358b1439af0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotChangeWorkplaneVisibility Property

Can't change Work Plane Visibility.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotChangeWorkplaneVisibility { get; }
```